# YOLOv13 with DINOv3-ConvNeXt backbone and YOLOv3-inspired architecture
# This configuration uses DINOv3 ConvNeXt variant for CNN-ViT hybrid architecture

nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  # YOLOv13 with YOLOv3-inspired darknet backbone
  - [-1, 1, Conv, [32, 3, 1]]       # 0
  - [-1, 1, Conv, [64, 3, 2]]       # 1-P1/2
  - [-1, 1, Bottleneck, [64]]       # 2
  - [-1, 1, Conv, [128, 3, 2]]      # 3-P2/4
  - [-1, 2, Bottleneck, [128]]      # 4
  - [-1, 1, Conv, [256, 3, 2]]      # 5-P3/8
  - [-1, 8, Bottleneck, [256]]      # 6
  - [-1, 1, Conv, [512, 3, 2]]      # 7-P4/16
  - [-1, 8, Bottleneck, [512]]      # 8: Standard processing before DINO3
  
  # DINOv3-ConvNeXt enhancement at P4 level (512 channels)
  - [-1, 1, DINO3Backbone, ['dinov3_convnext_base', True, 512]]  # 9: DINOv3-ConvNeXt enhanced P4 features
  
  # Continue YOLOv3-style processing
  - [-1, 1, Conv, [1024, 3, 2]]     # 10-P5/32
  - [-1, 4, Bottleneck, [1024]]     # 11

head:
  # YOLOv13 head with YOLOv3-inspired structure and DINO3-ConvNeXt enhanced features
  
  # P5 processing (large objects)
  - [-1, 1, Bottleneck, [1024, False]]     # 12
  - [-1, 1, Conv, [512, 1, 1]]             # 13
  - [-1, 1, Conv, [1024, 3, 1]]            # 14
  - [-1, 1, Conv, [512, 1, 1]]             # 15
  - [-1, 1, Conv, [1024, 3, 1]]            # 16 (P5/32-large)

  # P4 branch (medium objects) - uses DINO3-ConvNeXt enhanced features
  - [-2, 1, Conv, [256, 1, 1]]             # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 9], 1, Concat, [1]]              # 19: cat DINO3-enhanced P4 features (256+512=768ch)
  - [-1, 1, Conv, [512, 1, 1]]             # 20: reduce channels to 512
  - [-1, 1, Bottleneck, [512, False]]      # 21
  - [-1, 1, Conv, [256, 1, 1]]             # 22
  - [-1, 1, Conv, [512, 3, 1]]             # 23 (P4/16-medium)

  # P3 branch (small objects)
  - [-2, 1, Conv, [128, 1, 1]]             # 24
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 6], 1, Concat, [1]]              # 26: cat backbone P3 features (128+256=384ch)
  - [-1, 1, Conv, [256, 1, 1]]             # 27: reduce channels to 256
  - [-1, 1, Bottleneck, [256, False]]      # 28
  - [-1, 1, Bottleneck, [256, False]]      # 29 (P3/8-small)

  # P3 -> P4 connection
  - [-1, 1, Conv, [256, 3, 2]]             # 30: Downsample P3 back to P4
  - [[-1, 23], 1, Concat, [1]]             # 31: Concat with P4 (256+512=768ch)
  - [-1, 1, Conv, [512, 3, 1]]             # 32: Process -> 512ch (final P4)

  # P4 -> P5 connection  
  - [-1, 1, Conv, [512, 3, 2]]             # 33: Downsample P4 to P5
  - [[-1, 16], 1, Concat, [1]]             # 34: Concat with P5 (512+1024=1536ch)
  - [-1, 1, Conv, [1024, 3, 1]]            # 35: Process -> 1024ch (final P5)

  # Detection heads - P3(256ch), P4(512ch), P5(1024ch)
  - [[29, 32, 35], 1, Detect, [nc]]        # 36: Detect(P3, P4, P5)