# YOLOv13l with DINOv3 Dual-Scale Enhancement (Large variant)
# Usage: YOLO('yolov13-dino3-dual-l.yaml') - P3+P4 enhanced, large size
# Parameters: ~238M | GFLOPs: ~52.3

nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 512]    # Large

backbone:
  # [from, repeats, module, args]
  # YOLOv13 with YOLOv3-inspired darknet backbone (Large scaling)
  - [-1, 1, Conv, [32, 3, 1]]       # 0
  - [-1, 1, Conv, [64, 3, 2]]       # 1-P1/2
  - [-1, 1, Bottleneck, [64]]       # 2
  - [-1, 1, Conv, [128, 3, 2]]      # 3-P2/4
  - [-1, 2, Bottleneck, [128]]      # 4
  - [-1, 1, Conv, [256, 3, 2]]      # 5-P3/8
  - [-1, 8, Bottleneck, [256]]      # 6
  
  # DINOv3 enhancement at P3 level (256 channels - full for large)
  - [-1, 1, DINO3Backbone, ['dinov3_vitl16', True, 256]]  # 7: P3 DINO3 enhancement
  
  - [-1, 1, Conv, [512, 3, 2]]      # 8-P4/16
  - [-1, 8, Bottleneck, [512]]      # 9
  
  # DINOv3 enhancement at P4 level (512 channels - full for large)
  - [-1, 1, DINO3Backbone, ['dinov3_vitl16', True, 512]]  # 10: P4 DINO3 enhancement
  
  # Continue YOLOv3-style processing
  - [-1, 1, Conv, [1024, 3, 2]]     # 11-P5/32
  - [-1, 4, Bottleneck, [1024]]     # 12

head:
  # YOLOv13 head with dual DINO3-enhanced features (large scaling)
  
  # P5 processing (large objects)
  - [-1, 1, Bottleneck, [1024, False]]     # 13
  - [-1, 1, Conv, [512, 1, 1]]             # 14
  - [-1, 1, Conv, [1024, 3, 1]]            # 15
  - [-1, 1, Conv, [512, 1, 1]]             # 16
  - [-1, 1, Conv, [1024, 3, 1]]            # 17 (P5/32-large)

  # P4 branch (medium objects) - uses DINO3-enhanced features
  - [-2, 1, Conv, [256, 1, 1]]             # 18
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 10], 1, Concat, [1]]             # 20: cat DINO3-enhanced P4 features
  - [-1, 1, Conv, [512, 1, 1]]             # 21
  - [-1, 1, Bottleneck, [512, False]]      # 22
  - [-1, 1, Conv, [256, 1, 1]]             # 23
  - [-1, 1, Conv, [512, 3, 1]]             # 24 (P4/16-medium)

  # P3 branch (small objects) - uses DINO3-enhanced features
  - [-2, 1, Conv, [128, 1, 1]]             # 25
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26
  - [[-1, 7], 1, Concat, [1]]              # 27: cat DINO3-enhanced P3 features
  - [-1, 1, Conv, [256, 1, 1]]             # 28
  - [-1, 1, Bottleneck, [256, False]]      # 29
  - [-1, 1, Bottleneck, [256, False]]      # 30 (P3/8-small)

  # P3 -> P4 connection
  - [-1, 1, Conv, [256, 3, 2]]             # 31
  - [[-1, 24], 1, Concat, [1]]             # 32
  - [-1, 1, Conv, [512, 3, 1]]             # 33 (final P4)

  # P4 -> P5 connection  
  - [-1, 1, Conv, [512, 3, 2]]             # 34
  - [[-1, 17], 1, Concat, [1]]             # 35
  - [-1, 1, Conv, [1024, 3, 1]]            # 36 (final P5)

  # Detection heads - P3(256ch), P4(512ch), P5(1024ch)
  - [[30, 33, 36], 1, Detect, [nc]]        # 37: Detect(P3, P4, P5)