# YOLOv13 with DINOv3 backbone enhanced only at P3 level (small objects focus)
# This configuration focuses DINO enhancement on small object detection

nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  # YOLOv13 with YOLOv3-inspired darknet backbone
  - [-1, 1, Conv, [32, 3, 1]]       # 0
  - [-1, 1, Conv, [64, 3, 2]]       # 1-P1/2
  - [-1, 1, Bottleneck, [64]]       # 2
  - [-1, 1, Conv, [128, 3, 2]]      # 3-P2/4
  - [-1, 2, Bottleneck, [128]]      # 4
  - [-1, 1, Conv, [256, 3, 2]]      # 5-P3/8
  - [-1, 8, Bottleneck, [256]]      # 6: Standard P3 processing
  
  # DINOv3 enhancement at P3 level (256 channels) - focus on small objects
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 256]]  # 7: DINOv3 enhanced P3 features
  
  - [-1, 1, Conv, [512, 3, 2]]      # 8-P4/16
  - [-1, 8, Bottleneck, [512]]      # 9: Standard P4 processing (no DINO3)
  - [-1, 1, Conv, [1024, 3, 2]]     # 10-P5/32
  - [-1, 4, Bottleneck, [1024]]     # 11

head:
  # YOLOv13 head with DINO3-enhanced P3 features for improved small object detection
  
  # P5 processing (large objects)
  - [-1, 1, Bottleneck, [1024, False]]     # 12
  - [-1, 1, Conv, [512, 1, 1]]             # 13
  - [-1, 1, Conv, [1024, 3, 1]]            # 14
  - [-1, 1, Conv, [512, 1, 1]]             # 15
  - [-1, 1, Conv, [1024, 3, 1]]            # 16 (P5/32-large)

  # P4 branch (medium objects) - standard processing
  - [-2, 1, Conv, [256, 1, 1]]             # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 9], 1, Concat, [1]]              # 19: cat standard P4 features (256+512=768ch)
  - [-1, 1, Conv, [512, 1, 1]]             # 20: reduce channels to 512
  - [-1, 1, Bottleneck, [512, False]]      # 21
  - [-1, 1, Conv, [256, 1, 1]]             # 22
  - [-1, 1, Conv, [512, 3, 1]]             # 23 (P4/16-medium)

  # P3 branch (small objects) - uses DINO3-enhanced P3 features
  - [-2, 1, Conv, [128, 1, 1]]             # 24
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 7], 1, Concat, [1]]              # 26: cat DINO3-enhanced P3 features (128+256=384ch)
  - [-1, 1, Conv, [256, 1, 1]]             # 27: reduce channels to 256
  - [-1, 1, Bottleneck, [256, False]]      # 28
  - [-1, 1, Bottleneck, [256, False]]      # 29 (P3/8-small, DINO3-enhanced)

  # P3 -> P4 connection
  - [-1, 1, Conv, [256, 3, 2]]             # 30: Downsample DINO3-enhanced P3
  - [[-1, 23], 1, Concat, [1]]             # 31: Concat with standard P4 (256+512=768ch)
  - [-1, 1, Conv, [512, 3, 1]]             # 32: Process -> 512ch (final P4)

  # P4 -> P5 connection  
  - [-1, 1, Conv, [512, 3, 2]]             # 33: Downsample P4 to P5
  - [[-1, 16], 1, Concat, [1]]             # 34: Concat with P5 (512+1024=1536ch)
  - [-1, 1, Conv, [1024, 3, 1]]            # 35: Process -> 1024ch (final P5)

  # Detection heads - P3 enhanced with DINO3, P4 and P5 standard
  - [[29, 32, 35], 1, Detect, [nc]]        # 36: Detect(DINO3-P3, P4, P5)